cases/artigo_mestrado/on-caso-1.2/_grid/P3800_d1e15_linear/fluid/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default            Euler;
}

gradSchemes
{
    default            leastSquares;
}

divSchemes
{
    default            none;
    div(phi,U)         Gauss linearUpwind cellLimited leastSquares 1;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
}

laplacianSchemes
{
    default                                 none;
    laplacian(nuEff,U)                      Gauss linear corrected;
    laplacian(rAU,p)                        Gauss linear corrected;
    laplacian((1|A(U)),p)                   Gauss linear corrected;
    laplacian(diffusivity,cellMotionU)      Gauss linear corrected;
    laplacian(diffusivity,cellDisplacement) Gauss linear corrected;
    laplacian(rAUf,pcorr)                   Gauss linear corrected;
}

interpolationSchemes
{
    default            linear;
}

snGradSchemes
{
    default            corrected;
}

fluxRequired
{
    default            no;
    p;
}
